html/eldg.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>E-Learning: Video lectures filmed by students</title>
<!-- 2018-02-22 Thu 10:19 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="jde27" />
<meta name='viewport' content='width=device-width,
initial-scale=1.0'> <meta name='keywords' content='Jonny Evans,
mathematics, geometry, UCL'> <meta name='description'
content='Blog of the UCL-based mathematician Jonny Evans'>
<meta name='author' content='Jonny Evans'> 
<link rel='stylesheet' type='text/css' href='../aux/style.css'/>
<link rel='alternate' type='application/rss+xml' title='RSS feed' />
</head>
<body>
<div id="preamble" class="status">
<div class='banner'>
<a href='index.html'>Blog index</a> | <a href='http://www.homepages.ucl.ac.uk/~ucahjde'>Homepage</a> | <a href='blogroll.html'>Blogroll</a> | <a href='rss.xml'>RSS feed</a></div>
</div>
<div id="content">
<h1 class="title">E-Learning: Video lectures filmed by students</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">E-Learning: Video lectures filmed by students</h2>
<div class="outline-text-2" id="text-1">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2013-06-02 Tue]</span></span>
</p>

<p>
I recently received a grant from the UCL e-learning team to run a
project for filming maths lectures.
</p>

<p>
<b>The aim:</b> The aim is to provide UCL mathematics students with
high-quality video coverage of some of their core lectures. This would
be particularly useful in mathematics where material is hard to absorb
on a first hearing. We'd hope this would be particularly useful for
our many overseas students with English as an nth language for
n&gt;1. Many of our courses are big ancillary courses for other
departments and having lectures available online would help alleviate
the possible clashes that might occur in timetabling.
</p>

<p>
<b>The problem:</b> Mathematical pedagogy focuses on board-based lectures,
which are difficult to film under the current system used at UCL
because the camera quality is not sufficient to capture extensive
boardwork.
</p>

<p>
<b>The proposal:</b> Use a small, high-quality camera with a mount
(borrowed from the e-learning team), operated by students from the
front of the lecture theatre. We will train a group of students to act
as camera-operators.
</p>

<p>
This is only a trial, so we will concentrate on two second-year
courses (Mathematical Methods 3 and Complex Analysis), filmed by a
team of four students. These students would preferably be from other
classes so that the students in the target classes can focus on
learning and not on filming. This would result in a workload of one or
two hours/week for each student, which is hopefully not too much to
distract from their own lectures, and they will be paid for their work
(that's where the grant is going).
</p>

<p>
The results will be posted to Lecturecast and the students will be
able to give continuous feedback via Moodle forums, to that we can
optimise our filming techniques. We will also assess the effectiveness
of this method and the usefulness of the new resource using
questionnaires.
</p>

<p>
From a lecturer's perspective, I want my lectures to be videoed so
that I can watch them back and know where I need to explain things
better next time. While it is slightly terrifying for the
unintentional verbal and notational errors one makes during lectures
to be captured and viewable, it would surely be more useful for me to
spot them so that I know why my students are getting confused.
</p>

<p>
While high-quality tracking cameras might be an optimal solution to
this problem, they are expensive and we would first like to assess the
usefulness of video lectures to our students. I also think that having
a camera operated by someone who understands and appreciates the
lectures, someone who can point the camera at what they think is most
relevant, will lead to a more natural and useful video. I have seen
the results of tracking cameras before, and I usually ended up
standing on the far side of the board from the equation I was talking
about. Having the camera placed at the front of the lecture theatre
also seems like a more surefire way of being able to see what's been
written.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class='banner'>Comments, corrections and contributions are very welcome; please drop me an email at j.d.evans at ucl.ac.uk if you have something to share.</div><div class='bottomblock'><a class='cc' href='https://creativecommons.org/licenses/by-sa/4.0/legalcode'>CC-BY-SA</a>, Jonny Evans 2017</div>
</div>
</body>
</html>
